# ADA Cheat Sheet

In [2]:
import pandas as pd

### File reading

### How to plot

#### Useful Pandas functions

In [21]:
scientist = {'Name': ['Isaac Newton', 'Louis Pasteur', 'Galilieo', 'Marie Curie', 'Albert Einstein'],
             'From': ['1642', '1822', '1564', '1867', '1879'], 
             'To': ['1726', '1895', '1642', '1934', '1955']}
df = pd.DataFrame.from_dict(scientist)

In [23]:
df

              Name  From    To
0     Isaac Newton  1642  1726
1    Louis Pasteur  1822  1895
2         Galilieo  1564  1642
3      Marie Curie  1867  1934
4  Albert Einstein  1879  1955

In [24]:
df.transpose()

                 0              1         2            3                4
Name  Isaac Newton  Louis Pasteur  Galilieo  Marie Curie  Albert Einstein
From          1642           1822      1564         1867             1879
To            1726           1895      1642         1934             1955

In [26]:
pd.crosstab(df.From, df.To)

To    1642  1726  1895  1934  1955
From
1564     1     0     0     0     0
1642     0     1     0     0     0
1822     0     0     1     0     0
1867     0     0     0     1     0
1879     0     0     0     0     1

### Known issues

If mathematical operation between two cells doesn't work, check dtype
    
    difference = dataframe['first_column'] - dataframe['second_column']
    
Solution:

Check for dtype, change dtype where the cells were created

    dataframe['first_column'].dtype
        dtype('uint8')
    dataframe = pd.get_dummies(dataframe_original[dummy_variables], dtype='int')

## Spark